AlexGG27/Proiect_APM/pc_tests/SNIPPET_STM32_SystemClock_Config.c
#include "stm32f1xx_hal.h"

/*
 * Configurare ceas pentru STM32F103:
 * - sursa externa HSE activa
 * - HSI activ pentru siguranta la pornire
 * - PLL activ, alimentat din HSE
 * - factor de multiplicare PLL x9
 * - frecventa SYSCLK = 72 MHz
 * - AHB = SYSCLK / 1
 * - APB1 = HCLK / 2
 * - APB2 = HCLK / 1
 * - latenta Flash = 2 wait states
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /* Configurarea oscilatoarelor:
     * HSE este sursa principala, iar PLL-ul ridica frecventa la 72 MHz.
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /* Configurarea magistralelor:
     * - SYSCLK vine din PLL
     * - AHB merge la viteza maxima
     * - APB1 este impartit la 2
     * - APB2 ramane la frecventa maxima
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK
                                | RCC_CLOCKTYPE_SYSCLK
                                | RCC_CLOCKTYPE_PCLK1
                                | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
    {
        Error_Handler();
    }
}
